paypal-connector-test/src/test/resources/artifacts/ESB/config/soapRequests/paypal/createPayment.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.paypal.createPayment"> 
   <soapenv:Header/>
   <soapenv:Body>
      <urn:paypalApiUrl>https://api.sandbox.paypal.com</urn:paypalApiUrl>
      <urn:authorization>Bearer J2rIYYtGxmjEJGkHwf3tVEXpsjO9EsavwSZFSwfCaRI</urn:authorization>
      <urn:intent>sale</urn:intent>
      <urn:payment_method>credit_card</urn:payment_method>
      <urn:number>4417119669820331</urn:number>
      <urn:type>visa</urn:type>
      <urn:expire_month>11</urn:expire_month>
      <urn:expire_year>2018</urn:expire_year>
      <urn:cvv2>874</urn:cvv2>
      <urn:first_name>Joe</urn:first_name>
      <urn:last_name>Shopper</urn:last_name>
      <urn:line1>52 N Main ST</urn:line1>
      <urn:city>Johnstown</urn:city>
      <urn:country_code>US</urn:country_code>
      <urn:postal_code>43210</urn:postal_code>
      <urn:state>OH</urn:state>
      <urn:total>7.47</urn:total>
      <urn:currency>USD</urn:currency>
      <urn:subtotal>7.41</urn:subtotal>
      <urn:tax>0.03</urn:tax>
      <urn:shipping>0.03</urn:shipping>
      <urn:description>description":"This is the payment transaction description.</urn:description>
   </soapenv:Body>
</soapenv:Envelope>
